Repository: sudoHG/AskKey
Catalog: Sources/AskKeyApp/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Connect Ask Key to %@ and configure credential discovery before SSH.
zh_hans: 连接 Ask Key 到 %@，并配置 SSH 连接前的凭证查询。

source: Configuration files are backed up before changes. If discovery setup fails, the verified MCP connection is kept. Start a new task after setup.
zh_hans: 修改前会备份配置。如果连接前查询的配置失败，已验证的 MCP 连接会保留。配置完成后请新开任务。

source: Ask Key will back up %@'s user settings, add Ask Key and credential discovery before SSH, then verify the connection and configuration.
zh_hans: Ask Key 会先备份 %@ 的用户设置，接入 MCP 并配置 SSH 连接前的凭证查询，再验证连接并检查配置。

source: Before the first direct SSH connection in a turn, ask the agent to check the credential catalog. Credential access still needs approval. If the catalog is unavailable or its callback is lost, the reminder stops blocking after 30 seconds without progress.
zh_hans: 每轮首次直接连接 SSH 前，提醒 Agent 查询凭证目录。使用凭证仍需审批。目录不可用或完成通知丢失时，连续 30 秒没有进展便停止拦截，避免任务一直卡住。

source: Credential discovery setup was cancelled. The verified MCP connection was kept. Check again before continuing.
zh_hans: 连接前查询凭证的配置已取消，已验证的 MCP 连接会保留。继续前请重新检查。

source: %@ was not found. Install or open it, then check again.
zh_hans: 未找到 %@。请先安装或打开它，再重新检查。

source: Could not read %@'s local configuration. Check again.
zh_hans: 未能读取 %@ 的本机配置，请重新检查。

source: Local settings changed after review. Check again before confirming.
zh_hans: 本机配置在检查后发生了变化，请重新检查后再确认。

source: Before the first direct SSH command in each turn, ask Codex to check the credential catalog. Credential access still requires its existing approval. If this check is unavailable or takes over three seconds, Codex may continue without it.
zh_hans: 在每轮首次直接运行 SSH 前，提醒 Codex 查询凭证目录。实际使用凭证仍按原有规则审批。检查不可用或超过三秒时，Codex 可能直接继续。

source: Ask Key will back up Codex's user-level configuration, add Ask Key and credential discovery before SSH, then verify both. Only this Ask Key hook will be trusted.
zh_hans: Ask Key 会先备份 Codex 的用户配置，再添加接入和 SSH 连接前查询凭证，并分别验证。仅信任本次展示的 Ask Key 检查规则。

source: Last: MCP connected, setup incomplete · %@
zh_hans: 上次：MCP 已连接，接入尚未完成 · %@

source: Before SSH: credential discovery enabled
zh_hans: SSH 连接前查询凭证：已启用

source: Before SSH: credential discovery configured
zh_hans: SSH 连接前查询凭证：已配置

source: Before SSH: credential discovery not installed
zh_hans: SSH 连接前查询凭证：尚未安装

source: Before SSH: credential discovery disabled
zh_hans: SSH 连接前查询凭证：已停用

source: Before SSH: credential discovery awaiting trust
zh_hans: SSH 连接前查询凭证：待确认信任

source: Before SSH: credential discovery could not be verified
zh_hans: SSH 连接前查询凭证：未能确认状态

source: Credential discovery is enabled
zh_hans: 凭证查询：已启用

source: Credential discovery is configured
zh_hans: 凭证查询：已配置

source: Credential discovery is not installed
zh_hans: 凭证查询：尚未安装

source: Credential discovery is disabled
zh_hans: 凭证查询：已停用

source: Credential discovery is awaiting trust
zh_hans: 凭证查询：待确认信任

source: Credential discovery could not be verified
zh_hans: 凭证查询：未能确认状态

source: Connection check configuration
zh_hans: 查看连接前检查配置

source: MCP is connected and credential discovery before SSH is enabled. Start a new Codex task to use it.
zh_hans: MCP 已连接，SSH 连接前查询凭证已启用。新开一个 Codex 任务即可使用。

source: MCP is connected and credential discovery is configured. Start a new %@ task to use it.
zh_hans: MCP 已连接，凭证查询已配置。新开一个 %@ 任务即可使用。

source: MCP is connected, but credential discovery before SSH is not verified. Check again to finish setup.
zh_hans: MCP 已连接，但尚未确认 SSH 连接前查询凭证已启用。请重新检查以完成配置。

source: MCP is connected, but credential discovery is not verified. Check again to finish setup.
zh_hans: MCP 已连接，但尚未确认凭证查询配置。请重新检查以完成配置。

source: Connect Ask Key to Codex and enable credential discovery before SSH. Only this Ask Key hook will be trusted.
zh_hans: 接入 Ask Key，并启用 SSH 连接前查询凭证。确认后，仅信任本次展示的 Ask Key 检查规则。

source: Each configuration file is backed up before changes. A verified MCP connection is kept if hook setup needs another check. Start a new Codex task after setup.
zh_hans: 修改前分别备份配置文件。如果连接前检查未能完成，已验证的 MCP 连接会保留。配置完成后请新开 Codex 任务。

source: Check again
zh_hans: 重新检查

source: Complete: %@ is connected
zh_hans: 检查完成：%@ 已连接

source: Connection verification passed. No further setup is needed.
zh_hans: 连接验证已通过，无需重新配置。

source: Complete: workspace configuration confirmed
zh_hans: 检查完成：工作区配置已确认

source: Workspace configuration is present. Agent runtime access has not been verified.
zh_hans: 工作区接入配置已存在，尚未验证 Agent 的实际调用。

source: (Optional)
zh_hans: （可选）

source: %@ did not complete the connection check. Restart %@, then try again.
zh_hans: %@ 没有完成连接检测。请重启 %@，再重试。

source: %@ is installed
zh_hans: %@已安装

source: %@ is not installed
zh_hans: %@未安装

source: %@ requests to create a credential
zh_hans: 「%@」请求创建凭证

source: %@ requests to delete a credential
zh_hans: 「%@」请求删除凭证

source: %@ requests to modify a credential
zh_hans: 「%@」请求修改凭证

source: %@ requests to use a credential
zh_hans: 「%@」请求使用凭证

source: %@, installed
zh_hans: %@，已安装

source: %@, not installed
zh_hans: %@，未安装

source: %d environments
zh_hans: %d 个环境

source: %d secrets
zh_hans: %d 个凭证

source: %lld Agent requests are waiting
zh_hans: 有 %lld 个 Agent 请求等待决定

source: %lld Agent requests are waiting. You can decide without unlocking management.
zh_hans: 有 %lld 个 Agent 请求等待决定，不需要解锁管理。

source: %lld credential is protected. Agent requests still appear for you to decide.
zh_hans: 已有 %lld 份凭证受保护。Agent 请旨不受影响，仍会直接弹出确认框。

source: %lld credentials are protected. Agent requests still appear for you to decide.
zh_hans: 已有 %lld 份凭证受保护。Agent 请旨不受影响，仍会直接弹出确认框。

source: %lld credentials are protected. Start using Ask Key to unlock management.
zh_hans: 已有 %lld 份凭证受保护，开始使用后可解锁管理。

source: %lld credentials in %lld groups
zh_hans: 共 %lld 项凭证，%lld 个分组

source: %lld days remaining
zh_hans: 剩余 %lld 天

source: %lld items
zh_hans: %lld 项内容

source: %lld items are delivered together after one approval.
zh_hans: %lld 项内容会在一次授权后完整交付。

source: %lld minutes
zh_hans: %lld 分钟

source: .env File
zh_hans: .env 文件

source: 1 hour
zh_hans: 1 小时

source: 1 minute
zh_hans: 1 分钟

source: 15 minutes
zh_hans: 15 分钟

source: 15 seconds
zh_hans: 15 秒

source: 2 hours
zh_hans: 2 小时

source: 30 minutes
zh_hans: 30 分钟

source: 30 seconds
zh_hans: 30 秒

source: 5 minutes
zh_hans: 5 分钟

source: 60 minutes
zh_hans: 60 分钟

source: A %lld-minute allowance applies to all local callers for that credential, then expires. Changing the default does not extend an allowance already granted.
zh_hans: 允许 %lld 分钟对这份凭证的所有本地调用方生效，到期自动收回。已授予的限时允许不会被新默认值延长。

source: A credential can contain multiple text or file values. It is authorized as one unit.
zh_hans: 一份凭证可以包含多项文字或文件，并按整体统一授权。

source: A credential named "%@" already exists.
zh_hans: 已存在名为“%@”的凭证。

source: A credential named “%@” already exists. Choose for the whole credential: skip it, or authenticate to replace it with the imported content.
zh_hans: 已存在同名凭证「%@」。请选择整份凭证的处理方式：跳过这份，或验证身份后用导入内容替换现有内容。

source: A separate recovery key encrypts backups; neither Apple nor Ask Key can read them.
zh_hans: 备份用独立恢复密钥加密，Apple 和请旨服务器都读不到内容。

source: A system confirmation appears when a request arrives.
zh_hans: 请求到达时直接弹出系统确认框，由你当场决定。

source: A system confirmation appears when a request arrives; like Touch ID, one click and your fingerprint completes approval.
zh_hans: 请求到达时直接弹出系统确认框，像 Touch ID 一样，点一下加指纹就完成。

source: AI Agents
zh_hans: AI Agent

source: API Access Credential
zh_hans: API 访问凭证

source: API Endpoint
zh_hans: API 端点

source: API credential
zh_hans: API 凭证

source: ASK KEY · AGENT REQUEST
zh_hans: 请旨 · AGENT 请求

source: Access Key
zh_hans: 访问密钥

source: Access Key ID
zh_hans: 访问标识

source: Access Records
zh_hans: 访问记录

source: Access cloud platforms, storage, or CLIs
zh_hans: 访问云平台、对象存储或命令行工具

source: Access key and optional API endpoint
zh_hans: 访问密钥和可选的 API 端点

source: Access records
zh_hans: 访问记录

source: Active
zh_hans: 当前

source: Active environment — what terminals and agents resolve
zh_hans: 当前环境——终端和 Agent 默认读取这里

source: Activity
zh_hans: 活动记录

source: Add
zh_hans: 添加

source: Add File Key
zh_hans: 添加文件键

source: Add Secret
zh_hans: 添加凭证

source: Add Text Key
zh_hans: 添加文字键

source: Add a credential to keep it in Ask Key.
zh_hans: 添加一份凭证，保存在请旨里。

source: Add a credential to keep it in AskKey.
zh_hans: 添加一份凭证，保存在请旨里。

source: Add a text credential to keep it in AskKey.
zh_hans: 添加一份文本凭证，保存在请旨里。

source: Add credential
zh_hans: 添加凭证

source: Add environment
zh_hans: 添加环境

source: Add file
zh_hans: 添加文件

source: Add text
zh_hans: 添加文字

source: Add text or file values with keys, like .env
zh_hans: 像 .env 一样添加多个键，值可以是文字或文件

source: Add your first secret
zh_hans: 添加第一个凭证

source: After
zh_hans: 修改后

source: After turning this off, Ask Key will not start when the Mac restarts, and Agents will not get any credentials.
zh_hans: 关闭后，重启 Mac 请旨不会自己运行，Agent 将取不到任何凭证。

source: After turning this off, one click releases Agent read requests without confirming it is you. Credential changes still require authentication.
zh_hans: 关闭后，Agent 的读取请求点一下就放行，不再确认是不是你本人。修改凭证始终需要验证，不受影响。

source: Agent Access
zh_hans: Agent 访问

source: Agent Permission
zh_hans: Agent 使用权限

source: Agent Requests
zh_hans: Agent 请旨

source: Agent access
zh_hans: Agent 接入

source: Agent approvals
zh_hans: Agent 请旨

source: Agent requests open a system confirmation. Missed or deferred requests remain here.
zh_hans: Agent 请求到达时会直接弹出系统确认框；这里保留错过或稍后的请求。

source: Agents are never given this secret.
zh_hans: 任何情况下都不向 Agent 提供此凭证。

source: Agents can retrieve this secret through the MCP handoff.
zh_hans: Agent 可通过 MCP 安全交接直接使用此凭证。

source: Agents cannot use credentials while Ask Key is not running.
zh_hans: 请旨不运行时，Agent 无法取用凭证。

source: Agents must pass a Touch ID prompt each session before this secret is released.
zh_hans: 每次解锁会话首次使用前，需要人类通过 Touch ID 批准。

source: Agents must pass a Touch ID prompt on every read — approvals are never remembered.
zh_hans: 每次读取都需要人类通过 Touch ID 批准，不记住上一次授权。

source: All
zh_hans: 全部

source: All actions
zh_hans: 全部操作

source: All credentials
zh_hans: 全部凭证

source: All credentials are grouped, or there are no credentials yet.
zh_hans: 所有凭证都已有分组，或还没有凭证。

source: All projects
zh_hans: 全部项目

source: All sources
zh_hans: 全部来源

source: Allow
zh_hans: 允许

source: Allow Once
zh_hans: 仅本次

source: Allow for %lld Minutes
zh_hans: 允许 %lld 分钟

source: Allow: Agents can use this credential silently.
zh_hans: 允许：Agent 可以静默使用这份凭证。

source: Allowed
zh_hans: 已允许

source: Also Delete iCloud Backup
zh_hans: 同时删除 iCloud 备份

source: Always Allow
zh_hans: 始终允许使用

source: An existing Multica configuration was found.
zh_hans: 已发现现有 Multica 配置。

source: An older library or unfinished migration was found. After authentication, Ask Key will resume a confirmed migration or show a new preview for your approval.
zh_hans: 检测到旧版数据或未完成的迁移。认证后会恢复已确认的迁移，或展示新的迁移预览供你确认。

source: Another device wrote this backup. Confirm takeover first.
zh_hans: 这份备份由另一台设备写入，请先确认接管。

source: App
zh_hans: 应用

source: App ID, client secret, and private key file
zh_hans: App ID、客户端密钥和私钥文件

source: Appearance
zh_hans: 外观

source: Apple Signing
zh_hans: Apple 发布签名

source: Apple signing
zh_hans: Apple 签名

source: Applies to all local callers for this credential · Revocable anytime
zh_hans: 对这份凭证的所有本地调用方生效 · 可随时收回

source: Approval
zh_hans: 需请旨

source: Approve Change
zh_hans: 批准修改

source: Approve Creation
zh_hans: 批准创建

source: Approve Deletion
zh_hans: 批准删除

source: Approve this Agent credential change
zh_hans: 授权 AI 助手修改所选凭证

source: Approve this Agent credential request
zh_hans: 授权 AI 助手使用所选凭证

source: Ask
zh_hans: 请旨

source: Ask Every Time (Recommended)
zh_hans: 每次使用前问我（推荐）

source: Ask Key
zh_hans: 请旨

source: Ask Key backs up the current settings, then writes and verifies the connection automatically.
zh_hans: 请旨会先备份现有设置，再自动写入并验证连接。

source: Ask Key could not access the vault. Allow Keychain access, then try again.
zh_hans: 请旨无法访问凭证库。请允许钥匙串访问后重试。

source: Ask Key could not apply this decision. Open Pending requests to retry or reject it.
zh_hans: 请旨无法落实这次决定。请打开待处理请求重试或拒绝。

source: Ask Key could not clean up expired recycled credentials.
zh_hans: 请旨无法清理回收站中已过期的凭证。

source: Ask Key could not deliver an expiry reminder. The reminder will be retried.
zh_hans: 请旨无法投递到期提醒。将在下次启动或凭证变化后重试。

source: Ask Key could not open the local vault. Make sure the disk is available, then restart Ask Key. Existing data was not overwritten.
zh_hans: 请旨无法打开本机凭证库。请确认磁盘可用并重启请旨；现有数据没有被覆盖。

source: Ask Key could not prepare Agent access. Open the app to review the vault state.
zh_hans: 请旨无法准备 Agent 访问。请打开应用检查凭证库状态。

source: Ask Key could not read the local backup key. Check Keychain access.
zh_hans: 无法读取本机备份密钥，请检查钥匙串访问。

source: Ask Key could not remove a temporary credential file. It will keep retrying.
zh_hans: 请旨无法删除临时凭证文件，将继续重试。

source: Ask Key could not restore the original %@ configuration. Stop retrying and contact support.
zh_hans: 请旨无法恢复 %@ 的原配置。请停止重试并联系支持。

source: Ask Key could not save an access record. Credential operations continue, and this warning will remain until recording succeeds.
zh_hans: 请旨无法保存访问记录。凭证操作仍可继续，这条提示会保留到记录成功为止。

source: Ask Key could not save the local backup key. Check Keychain access.
zh_hans: 无法保存本机备份密钥，请检查钥匙串访问。

source: Ask Key could not schedule expiry reminders because notifications are turned off.
zh_hans: 请旨无法安排到期提醒，因为系统通知未开启。

source: Ask Key could not securely generate a recovery key. Try again.
zh_hans: 无法安全生成恢复密钥，请稍后重试。

source: Ask Key could not send the setup to Multica. Restart Multica, then try again.
zh_hans: 请旨无法把接入信息交给 Multica。请重启 Multica，再重试。

source: Ask Key could not finish restoring local settings. Agent access remains paused. Retry Agent access to finish the restore.
zh_hans: 请旨尚未完成本机设置恢复，Agent 访问保持暂停。请点击“重试 Agent 访问”完成恢复。

source: Ask Key could not start Agent access because it cannot write the secure staging folder. Fix folder permissions, then retry.
zh_hans: 请旨无法启动 Agent 访问，因为无法写入安全暂存文件夹。请修好文件夹权限后重试。

source: Ask Key could not start Agent access because the secure staging folder is a file. Remove that file, then retry.
zh_hans: 请旨无法启动 Agent 访问，因为安全暂存位置是一个文件。请删掉该文件后重试。

source: Ask Key could not start Agent access. Check the local Ask Key folder, then retry.
zh_hans: 请旨无法启动 Agent 访问。请检查本机请旨文件夹后重试。

source: Ask Key has a credential expiring soon
zh_hans: 请旨有凭证即将到期

source: Ask Key has not verified automatic setup for this Codex version. Contact support to confirm compatibility, then try again.
zh_hans: 请旨尚未确认当前 Codex 版本能否自动接入。请联系支持确认兼容性，再重试。

source: Ask Key has pending requests
zh_hans: 请旨有待处理请求

source: Ask Key is configured in Multica.
zh_hans: Multica 已配置请旨。

source: Ask Key is not running. Open Ask Key, then try again.
zh_hans: 请旨当前没有运行。请先打开请旨，再重试。

source: Ask Key must stay at /Applications/Ask Key.app. Reinstall the official package, then open that copy.
zh_hans: 请旨必须位于 /Applications/Ask Key.app。请重新安装官方安装包，然后打开这个位置的应用。

source: Ask Key runs in the background
zh_hans: 请旨在后台运行

source: Ask Key was added to %@ and the connection was verified.
zh_hans: 已将请旨写入 %@，并验证连接成功。

source: Ask Key will back up %@'s user-level configuration, add Ask Key, then verify the connection.
zh_hans: 请旨会先备份 %@ 的用户级配置，再写入请旨并验证连接。

source: Ask Key will use the existing Multica sign-in to add the configuration and assign it to agents.
zh_hans: 请旨会使用现有登录态在 Multica 添加配置并分配给 Agent。

source: Ask: Agents wait for your approval each time.
zh_hans: 请旨：每次使用都要等你批准。

source: AskKey only imports ordinary files. Directories are not allowed.
zh_hans: 请旨只能导入普通文件，不允许目录。

source: AskKey only imports ordinary files. Special files are not allowed.
zh_hans: 请旨只能导入普通文件，不允许特殊文件。

source: AskKey only imports ordinary files. Symbolic links are not allowed.
zh_hans: 请旨只能导入普通文件，不允许符号链接。

source: Authenticate and Continue
zh_hans: 认证并继续

source: Authenticate and Copy
zh_hans: 验证并复制

source: Authenticate and Erase
zh_hans: 验证并抹除

source: Authenticate and Replace
zh_hans: 验证后替换现有

source: Authenticate and Restore
zh_hans: 验证并恢复

source: Authenticate and Reveal
zh_hans: 验证并显示明文

source: Authenticate and Take Ownership
zh_hans: 验证并接管后续备份

source: Authenticate and View
zh_hans: 验证并查看

source: Authenticate to Edit Contents
zh_hans: 验证并编辑内容

source: Authenticate to Edit Private Notes
zh_hans: 验证身份后编辑私人备注

source: Auto-lock
zh_hans: 自动锁定

source: Automatic backup is paused until the backup conflict is resolved.
zh_hans: 自动备份已暂停，请先处理备份冲突。

source: Back
zh_hans: 返回

source: Back Up Now
zh_hans: 立即备份

source: Back to Edit
zh_hans: 返回修改

source: Backup cleanup state is invalid, so Ask Key stopped safely.
zh_hans: 备份清理状态异常，已安全停止。

source: Backup completed.
zh_hans: 已完成立即备份

source: Backup restored. The local credential list is up to date.
zh_hans: 备份已恢复，本机凭证列表已更新。

source: Before
zh_hans: 修改前

source: Binary file
zh_hans: 二进制文件

source: Blocked
zh_hans: 禁止 Agent 使用

# Brand monogram
source: A
zh_hans: 旨

source: Browse Credential Catalog
zh_hans: 浏览凭证目录

source: CLI
zh_hans: 命令行

source: CLI and MCP cannot obtain credentials while Ask Key is not running.
zh_hans: 请旨未运行时，CLI 和 MCP 无法取得凭证。

source: Caller
zh_hans: 调用方

source: Caller identity is self-declared and unverified. Decide from the credential and purpose.
zh_hans: 「声明」是调用方自报的身份，请旨无法核实；请按凭证与用途判断。

source: Cancel
zh_hans: 取消

source: Cancel Preview
zh_hans: 取消预览

source: Category
zh_hans: 类别

source: Certificate
zh_hans: 证书

source: Certificate File
zh_hans: 证书文件

source: Check Backup
zh_hans: 检查备份

source: Check for Updates
zh_hans: 检查更新

source: Check for Updates…
zh_hans: 检查更新…

source: Check whether Ask Key is configured in Multica.
zh_hans: 查看 Multica 是否已配置请旨。

source: Checking
zh_hans: 检查中

source: Chinese
zh_hans: 中文

source: Choose
zh_hans: 选择

source: Choose Backup
zh_hans: 选择备份

source: Choose File…
zh_hans: 选择文件…

source: Choose a client. Review how it connects, then decide whether to check or configure.
zh_hans: 选择你要使用的客户端。查看接入方式后，再决定是否检查或配置。

source: Choose an ordinary file before saving this credential.
zh_hans: 保存凭证前，请选择一个普通文件。

source: Choose file
zh_hans: 选择文件

source: Choose project icon
zh_hans: 选择项目图标

source: Choose the closest template. You can add or remove items later.
zh_hans: 选一个接近的开始，之后仍然可以增删内容。

source: Clear
zh_hans: 清除

source: Clear Ask Key access records
zh_hans: 确认清除请旨访问记录

source: Clear Clipboard
zh_hans: 清空剪贴板

source: Clear Records…
zh_hans: 清空记录…

source: Clear access records
zh_hans: 清空访问记录

source: Clear all access records?
zh_hans: 清空所有访问记录？

source: Click to copy (⌘C)
zh_hans: 点击复制（⌘C）

source: Client Secret
zh_hans: 客户端密钥

source: Cloud Account
zh_hans: 云服务账号

source: Cloud account
zh_hans: 云账号

source: Complete every credential component before saving.
zh_hans: 保存前请补全每一项凭证内容。

source: Configure
zh_hans: 配置

source: Configured
zh_hans: 已配置

source: Configured · Unverified
zh_hans: 已有配置 · 未验证

source: Confirm Clear
zh_hans: 确认清空

source: Confirm Group Deletion
zh_hans: 确认删除分组

source: Confirm Import
zh_hans: 确认导入

source: Confirm Permanent Deletion
zh_hans: 确认永久删除

source: Confirm and Migrate
zh_hans: 确认并迁移

source: Confirm credential management
zh_hans: 请确认以管理凭证

source: Confirm to manage credentials.
zh_hans: 确认后才能管理凭证。

source: Connect
zh_hans: 连接

source: Connect Codex, Cursor, Grok CLI, and self-hosted Multica.
zh_hans: 可接入 Codex、Cursor、Grok CLI 和自托管 Multica。

source: Connect to servers or deploy code
zh_hans: 连接服务器或部署代码

source: Connected
zh_hans: 已验证连接

source: Contains %lld items; skipped %lld blank lines.
zh_hans: 包含 %lld 项；跳过空行 %lld 行。

source: Contains 1 file. The original remains unchanged.
zh_hans: 包含 1 个文件；确认后原文件保持不变。

source: Contents stay hidden. Changing the name, group, or permission does not reveal plaintext.
zh_hans: 内容保持隐藏；改名称、分组或权限不需要查看明文。

source: Continue
zh_hans: 继续

source: Copied
zh_hans: 已复制

source: Copied · clears in %ds
zh_hans: 已复制 · %d 秒后清除

source: Copy
zh_hans: 复制

source: Copy .env
zh_hans: 复制 .env

source: Copy Value
zh_hans: 复制值

source: Copy all secrets in this view as a .env file
zh_hans: 把当前列表的凭证复制为 .env

source: Copy as KEY=value
zh_hans: 复制为 KEY=value

source: Copy as export KEY=value
zh_hans: 复制为 export KEY=value

source: Copy command
zh_hans: 复制命令

source: Create
zh_hans: 创建

source: Create Credential
zh_hans: 创建凭证

source: Create First Credential
zh_hans: 新建第一份凭证

source: Create a new Ask Key backup namespace
zh_hans: 确认创建新的请旨备份空间

source: Create a project to start storing secrets by environment.
zh_hans: 创建项目，按环境保管凭证。

source: Create credential
zh_hans: 创建凭证

source: Create one, or import from a file / .env. Agents can request it after it is saved.
zh_hans: 新建一份，或从文件 / .env 导入。保存后 Agent 才能按你的规则来请旨。

source: Create or import a credential to keep the materials your Agent needs together.
zh_hans: 创建或导入一份凭证，把要交给 Agent 的材料保存在一起。

source: Create or import your first credential to start.
zh_hans: 创建或导入第一份凭证，即可开始使用。

source: Create your first project
zh_hans: 创建第一个项目

source: Created
zh_hans: 创建时间

source: Created the first encrypted backup.
zh_hans: 已创建第一份加密备份

source: Credential
zh_hans: 凭证

source: Credential Library
zh_hans: 凭证库

source: Credential Management is Locked
zh_hans: 凭证管理已锁定

source: Credential Name
zh_hans: 凭证名称

source: Credential contents stay masked until you open the confirmation.
zh_hans: 凭证内容保持遮罩，打开确认框后再决定。

source: Credential group
zh_hans: 凭证分组

source: Credential management requires confirmation before it can continue.
zh_hans: 需要确认后才能继续管理凭证。

source: Credential names cannot be empty, contain control characters, exceed 255 characters, or exceed 4096 UTF-8 bytes.
zh_hans: 凭证名称不能为空、包含控制字符、超过 255 个字符或 4096 个 UTF-8 字节。

source: Credentials deleted from details remain here for 30 days.
zh_hans: 从详情页删除的凭证会在这里保留 30 天。

source: Custom Credential
zh_hans: 自定义凭证

source: Custom credential
zh_hans: 自定义凭证

source: DEV
zh_hans: 开发版

source: Danger Zone
zh_hans: 危险操作

source: Dark
zh_hans: 深色

source: Database
zh_hans: 数据库

source: Database connection
zh_hans: 数据库连接

source: Database or Service Connection
zh_hans: 数据库或服务连接

source: Days remaining unknown
zh_hans: 剩余天数未知

source: Decide Agent requests immediately
zh_hans: Agent 请求当场决定

source: Decide Requests Directly
zh_hans: 直接处理请求

source: Declared · Unverified
zh_hans: 声明 · 未经核实

source: Default Timed Allow
zh_hans: 默认限时允许

source: Default environment
zh_hans: 默认环境

source: Default project
zh_hans: 默认项目

source: Delete
zh_hans: 删除

source: Delete "%@"?
zh_hans: 删除“%@”？

source: Delete Ask Key iCloud backup
zh_hans: 确认删除请旨 iCloud 备份

source: Delete Credential
zh_hans: 删除凭证

source: Delete Environment and Secrets
zh_hans: 删除环境及其凭证

source: Delete Group…
zh_hans: 删除分组…

source: Delete Permanently…
zh_hans: 永久删除…

source: Delete Project
zh_hans: 删除项目

source: Delete Project and Contents
zh_hans: 删除项目及全部内容

source: Delete environment
zh_hans: 删除环境

source: Delete group
zh_hans: 删除分组

source: Delete group "%@"?
zh_hans: 删除分组“%@”？

source: Delete project
zh_hans: 删除项目

source: Deleted credentials remain for 30 days, then are removed permanently. Agents cannot access the Recycle Bin.
zh_hans: 删除的凭证保留 30 天，到期自动彻底删除；Agent 无法访问回收站。

source: Deleted credentials remain recoverable in the Recycle Bin for 30 days. Permanent deletion is available only there.
zh_hans: 删除后移入回收站保留 30 天，期间可恢复；只有在回收站里才能永久删除。

source: Deleted credentials stay here for 30 days. Agents cannot access them.
zh_hans: 删除的凭证会在这里保留 30 天；Agent 无法访问。

source: Deletes all local credentials, groups, and records. Uninstalling Ask Key does not do this.
zh_hans: 删除本机全部凭证、分组与记录。卸载请旨不会删除数据，只有这里会。

source: Delete…
zh_hans: 删除…

source: Deleting a group does not delete credentials. Its credentials become ungrouped.
zh_hans: 删除分组不会删除凭证，组内凭证会回到「未分组」。

source: Delivery
zh_hans: 交付方式

source: Delivery Environment Variable
zh_hans: 交付环境变量名

source: Delivery Options
zh_hans: 交付方式（可选）

source: Denied
zh_hans: 已拒绝

source: Deny
zh_hans: 拒绝

source: Description
zh_hans: 说明

source: Destination
zh_hans: 去向

source: Development build — uses a separate vault from the production app
zh_hans: 开发版——使用与正式版隔离的凭证库

source: Digest
zh_hans: 摘要
